logs/linode-linode1024-ubuntu/web_wp_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking x.x.x.x (be patient)


Server Software:        Apache
Server Hostname:        x.x.x.x
Server Port:            80

Document Path:          /wordpress/2017/05/01/hello-world
Document Length:        0 bytes

Concurrency Level:      50
Time taken for tests:   180.004 seconds
Complete requests:      9742
Failed requests:        0
Non-2xx responses:      9743
Total transferred:      3478251 bytes
HTML transferred:       0 bytes
Requests per second:    54.12 [#/sec] (mean)
Time per request:       923.857 [ms] (mean)
Time per request:       18.477 [ms] (mean, across all concurrent requests)
Transfer rate:          18.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       34   47  87.3     38    3129
Processing:   415  875 233.9    824    3277
Waiting:      415  871 232.9    821    3277
Total:        463  921 249.1    866    3986

Percentage of the requests served within a certain time (ms)
  50%    866
  66%    946
  75%   1009
  80%   1049
  90%   1178
  95%   1338
  98%   1745
  99%   1965
 100%   3986 (longest request)