logs/linode-linode1024-ubuntu/web_wp_wrk_200.log
Running 3m test @ http://x.x.x.x/wordpress/2017/05/09/hello-world/
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   255.68ms  160.19ms   1.99s    83.30%
    Req/Sec    47.25     26.07   131.00     65.01%
  Latency Distribution
     50%  209.79ms
     75%  283.88ms
     90%  452.55ms
     99%  835.46ms
  44710 requests in 3.00m, 71.50MB read
  Socket errors: connect 0, read 3, write 0, timeout 1071
  Non-2xx or 3xx responses: 43837
Requests/sec:    248.25
Transfer/sec:    406.56KB